# Реализуйте функцию get_digits() c использованием аннотаций типов, которая принимает один аргумент:
#
# number — положительное целое или вещественное число
# Функция должна возвращать список, состоящий из цифр числа number.

# def get_digits(number: int| float) ->list[int]:
#     return [int(i) for i in list(str(number)) if i != '.']


# Реализуйте функцию top_grade() c использованием аннотаций типов, которая принимает один аргумент:
#
# grades — словарь, содержащий данные об ученике, а именно имя по ключу name и список оценок по ключу grades
# Функция должна возвращать словарь, содержащий имя ученика по ключу name и его самую высокую оценку по ключу top_grade.








