# Дана строка соответствия латинскому алфавиту: первый символ строки
# соответствует букве a, второй — b, третий — c, и так далее. Каждый символ соответствует как заглавной,
# так и строчной буквам. Количество символов в строке совпадает с количеством букв в латинском алфавите.
# Напишите программу, которая с помощью данной строки переводит заданный текст.

# 😀😄😁😆😉😌😍🥰😘😗😙😚😋😛😝😜🤪🤨😫😩🥺😢😭😤😠😡
# Dont be so sad!

# 🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩
# I love Python =)

# import string
# trantab = str.maketrans(string.ascii_lowercase, input())
# text = input().lower()
# print (text.translate(trantab))


