# 1. Напишите программу, которая запрашивает у пользователя число N и выводит
# на экран таблицу умножения от 1 до N. Используйте вложенный цикл for для
# создания таблицы умножения. Выведите результат на экран с помощью команды print.

# num = int(input("Enter a number: ")) + 1
# l = len(str(num ** 2))+1
# for i in range(1, num):
#     for j in range(1, num):
#         print(str(i*j).ljust(l), end='')
#     print()

# 2. Напишите программу, которая принимает два списка одинаковой длины и создает новый
# список, содержащий пары элементов из исходных списков. Используйте функцию zip()
# для создания пар элементов. Выведите результат на экран с помощью команды print.

# res = list(zip(input().split(), input().split()))
# print(res)

def